---
kind: method
id: M:Autodesk.Revit.DB.Lighting.CircleLightShape.#ctor
source: html/c59c705d-ef05-88cd-6986-2c4fa041c536.htm
---
# Autodesk.Revit.DB.Lighting.CircleLightShape.#ctor Method

Creates a circle light shape object with 2.0' emit diameter.

## Syntax (C#)
```csharp
public CircleLightShape()
```